class YaScooterHomePageFAQ:
    first = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    second = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    third = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    fourth = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    fifth = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    sixth = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    seventh = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    eighth = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class YaScooterOrderPageData:
    data_sets = {
        'first_data': {
            'first_name': 'ЛеБрон',
            'last_name': 'Джеймс',
            'address': 'Ул. Великолепная',
            'subway_name': 'Фрунзенская',
            'telepthone_number': '79164136022',
            'date': '17.02.2024',
            'rental_period': 0,
            'color': [0],
            'comment_for_courier': 'Буду ждать вас рядом со своим Lambo Urus',
            'description': 'Корректные данные'
        },
        'second_data': {
            'first_name': 'Коби',
            'last_name': 'Брайант',
            'address': 'Чудесный пр-кт',
            'subway_name': 'Парк культуры',
            'telepthone_number': '89776545277',
            'date': '18.06.2024',
            'rental_period': 2,
            'color': [0, 1],
            'comment_for_courier': 'Брат, красиво оформи да',
            'description': 'Корректные данные'
        }
    }
